package backend.airo.api.shop.vo;

import lombok.Getter;
import lombok.RequiredArgsConstructor;

@RequiredArgsConstructor
@Getter
public enum ShopType {
    // ---- 음식 ----
    A05("A05", "음식"),
    A0502("A0502", "음식점"),

    // 소분류(음식점)
    A05020100("A05020100", "한식"),
    A05020200("A05020200", "서양식"),
    A05020300("A05020300", "일식"),
    A05020400("A05020400", "중식"),
    A05020700("A05020700", "이색음식점"),
    A05020900("A05020900", "카페/전통찻집"),
    A05021000("A05021000", "클럽"),


    // ---- 숙박 ----
    B02("B02", "숙박"),
    B0201("B0201", "숙박업"),

    // 소분류(숙박업)
    B02010100("B02010100", "관광호텔"),
    B02010500("B02010500", "콘도미니엄"),
    B02010600("B02010600", "유스호스텔"),
    B02010700("B02010700", "펜션"),
    B02010900("B02010900", "모텔"),
    B02011000("B02011000", "민박"),
    B02011100("B02011100", "게스트하우스"),
    B02011200("B02011200", "홈스테이"),
    B02011300("B02011300", "서비스드레지던스"),
    B02011600("B02011600", "한옥"),

    ;

    public enum Level { MAJOR, MID, SUB }

    private final String code;
    private final String name;

}